; ModuleID = 'gamma.ll'
source_filename = "gamma.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.cheb_series_struct = type { double*, i32, double, double, i32 }
%struct.anon = type { i32, double, i64 }
%struct.anon.0 = type { i32, double, i64 }
%struct.gsl_sf_result_struct = type { double, double }

@.str = private unnamed_addr constant [13 x i8] c"domain error\00", align 1
@.str.1 = private unnamed_addr constant [8 x i8] c"gamma.c\00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"error\00", align 1
@.str.3 = private unnamed_addr constant [37 x i8] c"x too large to extract fraction part\00", align 1
@.str.4 = private unnamed_addr constant [10 x i8] c"underflow\00", align 1
@gstar_a_cs = internal global %struct.cheb_series_struct { double* getelementptr inbounds ([30 x double], [30 x double]* @gstar_a_data, i32 0, i32 0), i32 29, double -1.000000e+00, double 1.000000e+00, i32 17 }, align 8
@gstar_b_cs = internal global %struct.cheb_series_struct { double* getelementptr inbounds ([30 x double], [30 x double]* @gstar_b_data, i32 0, i32 0), i32 29, double -1.000000e+00, double 1.000000e+00, i32 18 }, align 8
@.str.5 = private unnamed_addr constant [9 x i8] c"overflow\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-19ubuntu1 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !41, globals: !44)
!1 = !DIFile(filename: "gamma.c", directory: "/fpcc/gsl-2.5/specfunc")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 39, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/fpcc/gsl-2.5/specfunc")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40}
!6 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!7 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!8 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!9 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!10 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!11 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!12 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!13 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!14 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!15 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!16 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!17 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!18 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!19 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!20 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!21 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!22 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!23 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!24 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!25 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!26 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!27 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!28 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!29 = !DIEnumerator(name: "GSL_ESING", value: 21)
!30 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!31 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!32 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!33 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!34 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!35 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!36 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!37 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!38 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!39 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!40 = !DIEnumerator(name: "GSL_EOF", value: 32)
!41 = !{!42, !43}
!42 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!43 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!44 = !{!45, !49, !61, !65, !66, !70, !71, !72, !82}
!45 = distinct !DIGlobalVariable(name: "lanczos_7_c", scope: !0, file: !1, line: 644, type: !46, isLocal: true, isDefinition: true, variable: [9 x double]* @lanczos_7_c)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 576, align: 64, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 9)
!49 = distinct !DIGlobalVariable(name: "gamma_5_10_cs", scope: !0, file: !1, line: 1006, type: !50, isLocal: true, isDefinition: true, variable: %struct.cheb_series_struct* @gamma_5_10_cs)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "cheb_series", file: !52, line: 29, baseType: !53)
!52 = !DIFile(filename: "./chebyshev.h", directory: "/fpcc/gsl-2.5/specfunc")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cheb_series_struct", file: !52, line: 22, size: 320, align: 64, elements: !54)
!54 = !{!55, !57, !58, !59, !60}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !53, file: !52, line: 23, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !53, file: !52, line: 24, baseType: !42, size: 32, align: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !53, file: !52, line: 25, baseType: !43, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !53, file: !52, line: 26, baseType: !43, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "order_sp", scope: !53, file: !52, line: 27, baseType: !42, size: 32, align: 32, offset: 256)
!61 = distinct !DIGlobalVariable(name: "gamma_5_10_data", scope: !0, file: !1, line: 980, type: !62, isLocal: true, isDefinition: true, variable: [24 x double]* @gamma_5_10_data)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 1536, align: 64, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 24)
!65 = distinct !DIGlobalVariable(name: "gstar_a_cs", scope: !0, file: !1, line: 592, type: !51, isLocal: true, isDefinition: true, variable: %struct.cheb_series_struct* @gstar_a_cs)
!66 = distinct !DIGlobalVariable(name: "gstar_a_data", scope: !0, file: !1, line: 560, type: !67, isLocal: true, isDefinition: true, variable: [30 x double]* @gstar_a_data)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 1920, align: 64, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 30)
!70 = distinct !DIGlobalVariable(name: "gstar_b_cs", scope: !0, file: !1, line: 635, type: !51, isLocal: true, isDefinition: true, variable: %struct.cheb_series_struct* @gstar_b_cs)
!71 = distinct !DIGlobalVariable(name: "gstar_b_data", scope: !0, file: !1, line: 603, type: !67, isLocal: true, isDefinition: true, variable: [30 x double]* @gstar_b_data)
!72 = distinct !DIGlobalVariable(name: "fact_table", scope: !0, file: !1, line: 42, type: !73, isLocal: true, isDefinition: true, variable: [171 x %struct.anon]* @fact_table)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32832, align: 64, elements: !80)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 42, size: 192, align: 64, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !74, file: !1, line: 42, baseType: !42, size: 32, align: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !74, file: !1, line: 42, baseType: !43, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !74, file: !1, line: 42, baseType: !79, size: 64, align: 64, offset: 128)
!79 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!80 = !{!81}
!81 = !DISubrange(count: 171)
!82 = distinct !DIGlobalVariable(name: "doub_fact_table", scope: !0, file: !1, line: 251, type: !83, isLocal: true, isDefinition: true, variable: [298 x %struct.anon.0]* @doub_fact_table)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 57216, align: 64, elements: !89)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 251, size: 192, align: 64, elements: !85)
!85 = !{!86, !87, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !84, file: !1, line: 251, baseType: !42, size: 32, align: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !84, file: !1, line: 251, baseType: !43, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !84, file: !1, line: 251, baseType: !79, size: 64, align: 64, offset: 128)
!89 = !{!90}
!90 = !DISubrange(count: 298)
!91 = !{i32 2, !"Dwarf Version", i32 4}
!92 = !{i32 2, !"Debug Info Version", i32 3}
!93 = !{i32 1, !"PIC Level", i32 2}
!94 = !{!"clang version 3.9.1-19ubuntu1 (tags/RELEASE_391/rc2)"}
!95 = distinct !DISubprogram(name: "gsl_sf_lngamma_e", scope: !1, file: !1, line: 1114, type: !96, isLocal: false, isDefinition: true, scopeLine: 1115, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !105)
!96 = !DISubroutineType(types: !97)
!97 = !{!42, !43, !98}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_sf_result", file: !100, line: 41, baseType: !101)
!100 = !DIFile(filename: "../gsl/gsl_sf_result.h", directory: "/fpcc/gsl-2.5/specfunc")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_sf_result_struct", file: !100, line: 37, size: 128, align: 64, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !101, file: !100, line: 38, baseType: !43, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !101, file: !100, line: 39, baseType: !43, size: 64, align: 64, offset: 64)
!105 = !{}
!106 = !DILocalVariable(name: "x", arg: 1, scope: !95, file: !1, line: 1114, type: !43)
!107 = !DIExpression()
!108 = !DILocation(line: 1114, column: 29, scope: !95)
!109 = !DILocalVariable(name: "result", arg: 2, scope: !95, file: !1, line: 1114, type: !98)
!110 = !DILocation(line: 1114, column: 48, scope: !95)
!111 = !DILocation(line: 1118, column: 11, scope: !112)
!112 = distinct !DILexicalBlock(scope: !95, file: !1, line: 1118, column: 6)
!113 = !DILocation(line: 1118, column: 13, scope: !112)
!114 = !DILocation(line: 1118, column: 6, scope: !112)
!115 = !DILocation(line: 1118, column: 20, scope: !112)
!116 = !DILocation(line: 1118, column: 6, scope: !95)
!117 = !DILocalVariable(name: "stat", scope: !118, file: !1, line: 1125, type: !42)
!118 = distinct !DILexicalBlock(scope: !112, file: !1, line: 1118, column: 28)
!119 = !DILocation(line: 1125, column: 9, scope: !118)
!120 = !DILocation(line: 1125, column: 31, scope: !118)
!121 = !DILocation(line: 1125, column: 33, scope: !118)
!122 = !DILocation(line: 1125, column: 40, scope: !118)
!123 = !DILocation(line: 1125, column: 16, scope: !118)
!124 = !DILocation(line: 1126, column: 48, scope: !118)
!125 = !DILocation(line: 1126, column: 50, scope: !118)
!126 = !DILocation(line: 1126, column: 43, scope: !118)
!127 = !DILocation(line: 1126, column: 41, scope: !118)
!128 = !DILocation(line: 1126, column: 23, scope: !118)
!129 = !DILocation(line: 1126, column: 5, scope: !118)
!130 = !DILocation(line: 1126, column: 13, scope: !118)
!131 = !DILocation(line: 1126, column: 17, scope: !118)
!132 = !DILocation(line: 1127, column: 12, scope: !118)
!133 = !DILocation(line: 1127, column: 5, scope: !118)
!134 = !DILocation(line: 1129, column: 16, scope: !135)
!135 = distinct !DILexicalBlock(scope: !112, file: !1, line: 1129, column: 11)
!136 = !DILocation(line: 1129, column: 18, scope: !135)
!137 = !DILocation(line: 1129, column: 11, scope: !135)
!138 = !DILocation(line: 1129, column: 25, scope: !135)
!139 = !DILocation(line: 1129, column: 11, scope: !112)
!140 = !DILocalVariable(name: "stat", scope: !141, file: !1, line: 1130, type: !42)
!141 = distinct !DILexicalBlock(scope: !135, file: !1, line: 1129, column: 33)
!142 = !DILocation(line: 1130, column: 9, scope: !141)
!143 = !DILocation(line: 1130, column: 31, scope: !141)
!144 = !DILocation(line: 1130, column: 33, scope: !141)
!145 = !DILocation(line: 1130, column: 40, scope: !141)
!146 = !DILocation(line: 1130, column: 16, scope: !141)
!147 = !DILocation(line: 1131, column: 48, scope: !141)
!148 = !DILocation(line: 1131, column: 50, scope: !141)
!149 = !DILocation(line: 1131, column: 43, scope: !141)
!150 = !DILocation(line: 1131, column: 41, scope: !141)
!151 = !DILocation(line: 1131, column: 23, scope: !141)
!152 = !DILocation(line: 1131, column: 5, scope: !141)
!153 = !DILocation(line: 1131, column: 13, scope: !141)
!154 = !DILocation(line: 1131, column: 17, scope: !141)
!155 = !DILocation(line: 1132, column: 12, scope: !141)
!156 = !DILocation(line: 1132, column: 5, scope: !141)
!157 = !DILocation(line: 1134, column: 11, scope: !158)
!158 = distinct !DILexicalBlock(scope: !135, file: !1, line: 1134, column: 11)
!159 = !DILocation(line: 1134, column: 13, scope: !158)
!160 = !DILocation(line: 1134, column: 11, scope: !135)
!161 = !DILocation(line: 1135, column: 28, scope: !162)
!162 = distinct !DILexicalBlock(scope: !158, file: !1, line: 1134, column: 21)
!163 = !DILocation(line: 1135, column: 31, scope: !162)
!164 = !DILocation(line: 1135, column: 12, scope: !162)
!165 = !DILocation(line: 1135, column: 5, scope: !162)
!166 = !DILocation(line: 1137, column: 11, scope: !167)
!167 = distinct !DILexicalBlock(scope: !158, file: !1, line: 1137, column: 11)
!168 = !DILocation(line: 1137, column: 13, scope: !167)
!169 = !DILocation(line: 1137, column: 11, scope: !158)
!170 = !DILocation(line: 1138, column: 5, scope: !171)
