; ModuleID = 'mathieu_radfunc.c'
source_filename = "mathieu_radfunc.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.gsl_sf_result_struct = type { double, double }
%struct.gsl_sf_mathieu_workspace = type { i64, i64, i64, i32, double, double, double*, double*, double*, double*, double*, double*, double*, %struct.gsl_vector*, %struct.gsl_matrix*, %struct.gsl_eigen_symmv_workspace* }
%struct.gsl_vector = type { i64, i64, double*, %struct.gsl_block_struct*, i32 }
%struct.gsl_block_struct = type { i64, double* }
%struct.gsl_matrix = type { i64, i64, i64, double*, %struct.gsl_block_struct*, i32 }
%struct.gsl_eigen_symmv_workspace = type { i64, double*, double*, double*, double* }

@.str = private unnamed_addr constant [28 x i8] c"q must be greater than zero\00", align 1
@.str.1 = private unnamed_addr constant [18 x i8] c"mathieu_radfunc.c\00", align 1
@.str.2 = private unnamed_addr constant [20 x i8] c"kind must be 1 or 2\00", align 1
@.str.3 = private unnamed_addr constant [50 x i8] c"gsl_sf_mathieu_Mc_e(kind, order, qq, zz, &result)\00", align 1
@.str.4 = private unnamed_addr constant [50 x i8] c"gsl_sf_mathieu_Ms_e(kind, order, qq, zz, &result)\00", align 1

; Function Attrs: nounwind uwtable
define i32 @gsl_sf_mathieu_Mc_e(i32, i32, double, double, %struct.gsl_sf_result_struct*) #0 !dbg !45 {
  %6 = alloca i32, align 4
  %7 = alloca i32, align 4
  %8 = alloca i32, align 4
  %9 = alloca double, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-19ubuntu1 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "mathieu_radfunc.c", directory: "/fpcc/gsl-2.5/specfunc")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 39, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/fpcc/gsl-2.5/specfunc")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40}
!6 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!7 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!8 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!9 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!10 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!11 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!12 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!13 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!14 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!15 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!16 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!17 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!18 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!19 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!20 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!21 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!22 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!23 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!24 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!25 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!26 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!27 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!28 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!29 = !DIEnumerator(name: "GSL_ESING", value: 21)
!30 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!31 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!32 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!33 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!34 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!35 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!36 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!37 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!38 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!39 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!40 = !DIEnumerator(name: "GSL_EOF", value: 32)
!41 = !{i32 2, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{i32 1, !"PIC Level", i32 2}
!44 = !{!"clang version 3.9.1-19ubuntu1 (tags/RELEASE_391/rc2)"}
!45 = distinct !DISubprogram(name: "gsl_sf_mathieu_Mc_e", scope: !1, file: !1, line: 30, type: !46, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !57)
!46 = !DISubroutineType(types: !47)
!47 = !{!48, !48, !48, !49, !49, !50}
!48 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!49 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_sf_result", file: !52, line: 41, baseType: !53)
!52 = !DIFile(filename: "../gsl/gsl_sf_result.h", directory: "/fpcc/gsl-2.5/specfunc")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_sf_result_struct", file: !52, line: 37, size: 128, align: 64, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !53, file: !52, line: 38, baseType: !49, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !53, file: !52, line: 39, baseType: !49, size: 64, align: 64, offset: 64)
!57 = !{}
!58 = !DILocalVariable(name: "kind", arg: 1, scope: !45, file: !1, line: 30, type: !48)
!59 = !DIExpression()
!60 = !DILocation(line: 30, column: 29, scope: !45)
!61 = !DILocalVariable(name: "order", arg: 2, scope: !45, file: !1, line: 30, type: !48)
!62 = !DILocation(line: 30, column: 39, scope: !45)
!63 = !DILocalVariable(name: "qq", arg: 3, scope: !45, file: !1, line: 30, type: !49)
!64 = !DILocation(line: 30, column: 53, scope: !45)
!65 = !DILocalVariable(name: "zz", arg: 4, scope: !45, file: !1, line: 30, type: !49)
!66 = !DILocation(line: 30, column: 64, scope: !45)
!67 = !DILocalVariable(name: "result", arg: 5, scope: !45, file: !1, line: 31, type: !50)
!68 = !DILocation(line: 31, column: 38, scope: !45)
!69 = !DILocalVariable(name: "even_odd", scope: !45, file: !1, line: 33, type: !48)
!70 = !DILocation(line: 33, column: 7, scope: !45)
!71 = !DILocalVariable(name: "kk", scope: !45, file: !1, line: 33, type: !48)
!72 = !DILocation(line: 33, column: 17, scope: !45)
!73 = !DILocalVariable(name: "mm", scope: !45, file: !1, line: 33, type: !48)
!74 = !DILocation(line: 33, column: 21, scope: !45)
!75 = !DILocalVariable(name: "status", scope: !45, file: !1, line: 33, type: !48)
!76 = !DILocation(line: 33, column: 25, scope: !45)
!77 = !DILocalVariable(name: "maxerr", scope: !45, file: !1, line: 34, type: !49)
!78 = !DILocation(line: 34, column: 10, scope: !45)
!79 = !DILocalVariable(name: "amax", scope: !45, file: !1, line: 34, type: !49)
!80 = !DILocation(line: 34, column: 26, scope: !45)
!81 = !DILocalVariable(name: "pi", scope: !45, file: !1, line: 34, type: !49)
!82 = !DILocation(line: 34, column: 32, scope: !45)
!83 = !DILocalVariable(name: "fn", scope: !45, file: !1, line: 34, type: !49)
!84 = !DILocation(line: 34, column: 43, scope: !45)
!85 = !DILocalVariable(name: "factor", scope: !45, file: !1, line: 34, type: !49)
!86 = !DILocation(line: 34, column: 47, scope: !45)
!87 = !DILocalVariable(name: "coeff", scope: !45, file: !1, line: 35, type: !88)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 6400, align: 64, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 100)
!91 = !DILocation(line: 35, column: 10, scope: !45)
!92 = !DILocalVariable(name: "fc", scope: !45, file: !1, line: 35, type: !49)
!93 = !DILocation(line: 35, column: 39, scope: !45)
!94 = !DILocalVariable(name: "j1c", scope: !45, file: !1, line: 36, type: !49)
!95 = !DILocation(line: 36, column: 10, scope: !45)
!96 = !DILocalVariable(name: "z2c", scope: !45, file: !1, line: 36, type: !49)
!97 = !DILocation(line: 36, column: 15, scope: !45)
!98 = !DILocalVariable(name: "j1pc", scope: !45, file: !1, line: 36, type: !49)
!99 = !DILocation(line: 36, column: 20, scope: !45)
!100 = !DILocalVariable(name: "z2pc", scope: !45, file: !1, line: 36, type: !49)
!101 = !DILocation(line: 36, column: 26, scope: !45)
!102 = !DILocalVariable(name: "u1", scope: !45, file: !1, line: 37, type: !49)
!103 = !DILocation(line: 37, column: 10, scope: !45)
!104 = !DILocalVariable(name: "u2", scope: !45, file: !1, line: 37, type: !49)
!105 = !DILocation(line: 37, column: 14, scope: !45)
!106 = !DILocalVariable(name: "aa", scope: !45, file: !1, line: 38, type: !51)
!107 = !DILocation(line: 38, column: 17, scope: !45)
!108 = !DILocation(line: 42, column: 7, scope: !109)
!109 = distinct !DILexicalBlock(scope: !45, file: !1, line: 42, column: 7)
!110 = !DILocation(line: 42, column: 10, scope: !109)
!111 = !DILocation(line: 42, column: 7, scope: !45)
!112 = !DILocation(line: 44, column: 7, scope: !113)
!113 = distinct !DILexicalBlock(scope: !109, file: !1, line: 43, column: 3)
!114 = distinct !{!114, !112}
!115 = !DILocation(line: 44, column: 7, scope: !116)
!116 = !DILexicalBlockFile(scope: !117, file: !1, discriminator: 1)
!117 = distinct !DILexicalBlock(scope: !113, file: !1, line: 44, column: 7)
!118 = !DILocation(line: 45, column: 3, scope: !113)
!119 = !DILocation(line: 46, column: 7, scope: !120)
!120 = distinct !DILexicalBlock(scope: !45, file: !1, line: 46, column: 7)
!121 = !DILocation(line: 46, column: 12, scope: !120)
!122 = !DILocation(line: 46, column: 16, scope: !120)
!123 = !DILocation(line: 46, column: 19, scope: !124)
!124 = !DILexicalBlockFile(scope: !120, file: !1, discriminator: 1)
!125 = !DILocation(line: 46, column: 24, scope: !124)
!126 = !DILocation(line: 46, column: 7, scope: !124)
!127 = !DILocation(line: 48, column: 7, scope: !128)
!128 = distinct !DILexicalBlock(scope: !120, file: !1, line: 47, column: 3)
!129 = distinct !{!129, !127}
!130 = !DILocation(line: 48, column: 7, scope: !131)
!131 = !DILexicalBlockFile(scope: !132, file: !1, discriminator: 1)
!132 = distinct !DILexicalBlock(scope: !128, file: !1, line: 48, column: 7)
!133 = !DILocation(line: 49, column: 3, scope: !128)
!134 = !DILocation(line: 51, column: 6, scope: !45)
!135 = !DILocation(line: 52, column: 8, scope: !45)
!136 = !DILocation(line: 53, column: 6, scope: !45)
!137 = !DILocation(line: 54, column: 13, scope: !45)
!138 = !DILocation(line: 54, column: 8, scope: !45)
!139 = !DILocation(line: 54, column: 26, scope: !45)
!140 = !DILocation(line: 54, column: 25, scope: !45)
!141 = !DILocation(line: 54, column: 17, scope: !142)
!142 = !DILexicalBlockFile(scope: !45, file: !1, discriminator: 1)
!143 = !DILocation(line: 54, column: 16, scope: !45)
!144 = !DILocation(line: 54, column: 6, scope: !45)
!145 = !DILocation(line: 55, column: 13, scope: !45)
!146 = !DILocation(line: 55, column: 8, scope: !45)
!147 = !DILocation(line: 55, column: 21, scope: !45)
!148 = !DILocation(line: 55, column: 17, scope: !142)
!149 = !DILocation(line: 55, column: 16, scope: !45)
!150 = !DILocation(line: 55, column: 6, scope: !45)
!151 = !DILocation(line: 57, column: 12, scope: !45)
!152 = !DILocation(line: 58, column: 7, scope: !153)
!153 = distinct !DILexicalBlock(scope: !45, file: !1, line: 58, column: 7)
!154 = !DILocation(line: 58, column: 13, scope: !153)
!155 = !DILocation(line: 58, column: 17, scope: !153)
!156 = !DILocation(line: 58, column: 7, scope: !45)
!157 = !DILocation(line: 59, column: 16, scope: !153)
!158 = !DILocation(line: 59, column: 7, scope: !153)
!159 = !DILocation(line: 62, column: 31, scope: !45)
!160 = !DILocation(line: 62, column: 38, scope: !45)
!161 = !DILocation(line: 62, column: 12, scope: !45)
!162 = !DILocation(line: 62, column: 10, scope: !45)
!163 = !DILocation(line: 63, column: 7, scope: !164)
!164 = distinct !DILexicalBlock(scope: !45, file: !1, line: 63, column: 7)
!165 = !DILocation(line: 63, column: 14, scope: !164)
!166 = !DILocation(line: 63, column: 7, scope: !45)
!167 = !DILocation(line: 65, column: 14, scope: !168)
!168 = distinct !DILexicalBlock(scope: !164, file: !1, line: 64, column: 3)
!169 = !DILocation(line: 65, column: 7, scope: !168)
!170 = !DILocation(line: 69, column: 35, scope: !45)
!171 = !DILocation(line: 69, column: 42, scope: !45)
!172 = !DILocation(line: 69, column: 49, scope: !45)
!173 = !DILocation(line: 69, column: 54, scope: !45)
!174 = !DILocation(line: 69, column: 12, scope: !45)
!175 = !DILocation(line: 69, column: 10, scope: !45)
!176 = !DILocation(line: 70, column: 7, scope: !177)
!177 = distinct !DILexicalBlock(scope: !45, file: !1, line: 70, column: 7)
!178 = !DILocation(line: 70, column: 14, scope: !177)
!179 = !DILocation(line: 70, column: 7, scope: !45)
!180 = !DILocation(line: 72, column: 14, scope: !181)
!181 = distinct !DILexicalBlock(scope: !177, file: !1, line: 71, column: 3)
!182 = !DILocation(line: 72, column: 7, scope: !181)
!183 = !DILocation(line: 75, column: 7, scope: !184)
!184 = distinct !DILexicalBlock(scope: !45, file: !1, line: 75, column: 7)
!185 = !DILocation(line: 75, column: 16, scope: !184)
!186 = !DILocation(line: 75, column: 7, scope: !45)
!187 = !DILocation(line: 77, column: 14, scope: !188)
!188 = distinct !DILexicalBlock(scope: !189, file: !1, line: 77, column: 7)
!189 = distinct !DILexicalBlock(scope: !184, file: !1, line: 76, column: 3)
!190 = !DILocation(line: 77, column: 12, scope: !188)
!191 = !DILocation(line: 77, column: 18, scope: !192)
!192 = !DILexicalBlockFile(scope: !193, file: !1, discriminator: 1)
!193 = distinct !DILexicalBlock(scope: !188, file: !1, line: 77, column: 7)
!194 = !DILocation(line: 77, column: 20, scope: !192)
!195 = !DILocation(line: 77, column: 7, scope: !192)
!196 = !DILocation(line: 79, column: 18, scope: !197)
!197 = distinct !DILexicalBlock(scope: !193, file: !1, line: 78, column: 7)
!198 = !DILocation(line: 79, column: 18, scope: !199)
!199 = !DILexicalBlockFile(scope: !197, file: !1, discriminator: 1)
!200 = !DILocation(line: 79, column: 18, scope: !201)
!201 = !DILexicalBlockFile(scope: !197, file: !1, discriminator: 2)
!202 = !DILocation(line: 79, column: 18, scope: !203)
!203 = !DILexicalBlockFile(scope: !197, file: !1, discriminator: 3)
!204 = !DILocation(line: 79, column: 16, scope: !203)
!205 = !DILocation(line: 80, column: 26, scope: !206)
!206 = distinct !DILexicalBlock(scope: !197, file: !1, line: 80, column: 15)
!207 = !DILocation(line: 80, column: 20, scope: !206)
!208 = !DILocation(line: 80, column: 15, scope: !206)
!209 = !DILocation(line: 80, column: 31, scope: !206)
!210 = !DILocation(line: 80, column: 30, scope: !206)
!211 = !DILocation(line: 80, column: 38, scope: !206)
!212 = !DILocation(line: 80, column: 36, scope: !206)
!213 = !DILocation(line: 80, column: 15, scope: !197)
!214 = !DILocation(line: 81, column: 15, scope: !206)
!215 = !DILocation(line: 83, column: 34, scope: !197)
!216 = !DILocation(line: 83, column: 38, scope: !197)
!217 = !DILocation(line: 83, column: 17, scope: !197)
!218 = !DILocation(line: 83, column: 15, scope: !197)
!219 = !DILocation(line: 84, column: 15, scope: !220)
!220 = distinct !DILexicalBlock(scope: !197, file: !1, line: 84, column: 15)
!221 = !DILocation(line: 84, column: 20, scope: !220)
!222 = !DILocation(line: 84, column: 15, scope: !197)
!223 = !DILocation(line: 86, column: 38, scope: !224)
!224 = distinct !DILexicalBlock(scope: !220, file: !1, line: 85, column: 11)
!225 = !DILocation(line: 86, column: 42, scope: !224)
!226 = !DILocation(line: 86, column: 21, scope: !224)
!227 = !DILocation(line: 86, column: 19, scope: !224)
!228 = !DILocation(line: 87, column: 11, scope: !224)
!229 = !DILocation(line: 90, column: 38, scope: !230)
!230 = distinct !DILexicalBlock(scope: !220, file: !1, line: 89, column: 11)
!231 = !DILocation(line: 90, column: 42, scope: !230)
!232 = !DILocation(line: 90, column: 21, scope: !230)
!233 = !DILocation(line: 90, column: 19, scope: !230)
!234 = !DILocation(line: 93, column: 30, scope: !197)
!235 = !DILocation(line: 93, column: 29, scope: !197)
!236 = !DILocation(line: 93, column: 36, scope: !197)
!237 = !DILocation(line: 93, column: 35, scope: !197)
!238 = !DILocation(line: 93, column: 16, scope: !197)
!239 = !DILocation(line: 93, column: 46, scope: !197)
!240 = !DILocation(line: 93, column: 40, scope: !197)
!241 = !DILocation(line: 93, column: 39, scope: !197)
!242 = !DILocation(line: 93, column: 14, scope: !197)
!243 = !DILocation(line: 94, column: 17, scope: !197)
!244 = !DILocation(line: 94, column: 20, scope: !197)
!245 = !DILocation(line: 94, column: 19, scope: !197)
!246 = !DILocation(line: 94, column: 24, scope: !197)
!247 = !DILocation(line: 94, column: 23, scope: !197)
!248 = !DILocation(line: 94, column: 14, scope: !197)
!249 = !DILocation(line: 95, column: 7, scope: !197)
!250 = !DILocation(line: 77, column: 45, scope: !251)
!251 = !DILexicalBlockFile(scope: !193, file: !1, discriminator: 2)
!252 = !DILocation(line: 77, column: 7, scope: !251)
!253 = distinct !{!253, !254}
!254 = !DILocation(line: 77, column: 7, scope: !189)
!255 = !DILocation(line: 97, column: 18, scope: !189)
!256 = !DILocation(line: 97, column: 20, scope: !189)
!257 = !DILocation(line: 97, column: 13, scope: !189)
!258 = !DILocation(line: 97, column: 26, scope: !189)
!259 = !DILocation(line: 97, column: 25, scope: !189)
!260 = !DILocation(line: 97, column: 10, scope: !189)
!261 = !DILocation(line: 98, column: 3, scope: !189)
!262 = !DILocation(line: 101, column: 14, scope: !263)
!263 = distinct !DILexicalBlock(scope: !264, file: !1, line: 101, column: 7)
!264 = distinct !DILexicalBlock(scope: !184, file: !1, line: 100, column: 3)
!265 = !DILocation(line: 101, column: 12, scope: !263)
!266 = !DILocation(line: 101, column: 18, scope: !267)
!267 = !DILexicalBlockFile(scope: !268, file: !1, discriminator: 1)
!268 = distinct !DILexicalBlock(scope: !263, file: !1, line: 101, column: 7)
!269 = !DILocation(line: 101, column: 20, scope: !267)
!270 = !DILocation(line: 101, column: 7, scope: !267)
!271 = !DILocation(line: 103, column: 18, scope: !272)
!272 = distinct !DILexicalBlock(scope: !268, file: !1, line: 102, column: 7)
!273 = !DILocation(line: 103, column: 18, scope: !274)
!274 = !DILexicalBlockFile(scope: !272, file: !1, discriminator: 1)
!275 = !DILocation(line: 103, column: 18, scope: !276)
!276 = !DILexicalBlockFile(scope: !272, file: !1, discriminator: 2)
!277 = !DILocation(line: 103, column: 18, scope: !278)
!278 = !DILexicalBlockFile(scope: !272, file: !1, discriminator: 3)
!279 = !DILocation(line: 103, column: 16, scope: !278)
!280 = !DILocation(line: 104, column: 26, scope: !281)
!281 = distinct !DILexicalBlock(scope: !272, file: !1, line: 104, column: 15)
!282 = !DILocation(line: 104, column: 20, scope: !281)
!283 = !DILocation(line: 104, column: 15, scope: !281)
!284 = !DILocation(line: 104, column: 31, scope: !281)
!285 = !DILocation(line: 104, column: 30, scope: !281)
!286 = !DILocation(line: 104, column: 38, scope: !281)
!287 = !DILocation(line: 104, column: 36, scope: !281)
!288 = !DILocation(line: 104, column: 15, scope: !272)
!289 = !DILocation(line: 105, column: 15, scope: !281)
!290 = !DILocation(line: 107, column: 34, scope: !272)
!291 = !DILocation(line: 107, column: 38, scope: !272)
!292 = !DILocation(line: 107, column: 17, scope: !272)
!293 = !DILocation(line: 107, column: 15, scope: !272)
!294 = !DILocation(line: 108, column: 35, scope: !272)
!295 = !DILocation(line: 108, column: 37, scope: !272)
!296 = !DILocation(line: 108, column: 41, scope: !272)
!297 = !DILocation(line: 108, column: 18, scope: !272)
!298 = !DILocation(line: 108, column: 16, scope: !272)
!299 = !DILocation(line: 109, column: 15, scope: !300)
!300 = distinct !DILexicalBlock(scope: !272, file: !1, line: 109, column: 15)
!301 = !DILocation(line: 109, column: 20, scope: !300)
!302 = !DILocation(line: 109, column: 15, scope: !272)
!303 = !DILocation(line: 111, column: 38, scope: !304)
!304 = distinct !DILexicalBlock(scope: !300, file: !1, line: 110, column: 11)
!305 = !DILocation(line: 111, column: 42, scope: !304)
!306 = !DILocation(line: 111, column: 21, scope: !304)
!307 = !DILocation(line: 111, column: 19, scope: !304)
!308 = !DILocation(line: 112, column: 39, scope: !304)
!309 = !DILocation(line: 112, column: 41, scope: !304)
!310 = !DILocation(line: 112, column: 45, scope: !304)
!311 = !DILocation(line: 112, column: 22, scope: !304)
!312 = !DILocation(line: 112, column: 20, scope: !304)
!313 = !DILocation(line: 113, column: 11, scope: !304)
!314 = !DILocation(line: 116, column: 38, scope: !315)
!315 = distinct !DILexicalBlock(scope: !300, file: !1, line: 115, column: 11)
!316 = !DILocation(line: 116, column: 42, scope: !315)
!317 = !DILocation(line: 116, column: 21, scope: !315)
!318 = !DILocation(line: 116, column: 19, scope: !315)
!319 = !DILocation(line: 117, column: 39, scope: !315)
!320 = !DILocation(line: 117, column: 41, scope: !315)
!321 = !DILocation(line: 117, column: 45, scope: !315)
!322 = !DILocation(line: 117, column: 22, scope: !315)
!323 = !DILocation(line: 117, column: 20, scope: !315)
!324 = !DILocation(line: 119, column: 31, scope: !272)
!325 = !DILocation(line: 119, column: 36, scope: !272)
!326 = !DILocation(line: 119, column: 30, scope: !272)
!327 = !DILocation(line: 119, column: 29, scope: !272)
!328 = !DILocation(line: 119, column: 40, scope: !272)
!329 = !DILocation(line: 119, column: 39, scope: !272)
!330 = !DILocation(line: 119, column: 16, scope: !272)
!331 = !DILocation(line: 119, column: 50, scope: !272)
!332 = !DILocation(line: 119, column: 44, scope: !272)
!333 = !DILocation(line: 119, column: 43, scope: !272)
!334 = !DILocation(line: 119, column: 14, scope: !272)
!335 = !DILocation(line: 120, column: 17, scope: !272)
!336 = !DILocation(line: 120, column: 21, scope: !272)
!337 = !DILocation(line: 120, column: 25, scope: !272)
!338 = !DILocation(line: 120, column: 24, scope: !272)
!339 = !DILocation(line: 120, column: 32, scope: !272)
!340 = !DILocation(line: 120, column: 37, scope: !272)
!341 = !DILocation(line: 120, column: 36, scope: !272)
!342 = !DILocation(line: 120, column: 30, scope: !272)
!343 = !DILocation(line: 120, column: 19, scope: !272)
!344 = !DILocation(line: 120, column: 14, scope: !272)
!345 = !DILocation(line: 121, column: 7, scope: !272)
!346 = !DILocation(line: 101, column: 45, scope: !347)
!347 = !DILexicalBlockFile(scope: !268, file: !1, discriminator: 2)
!348 = !DILocation(line: 101, column: 7, scope: !347)
!349 = distinct !{!349, !350}
!350 = !DILocation(line: 101, column: 7, scope: !264)
!351 = !DILocation(line: 123, column: 18, scope: !264)
!352 = !DILocation(line: 123, column: 20, scope: !264)
!353 = !DILocation(line: 123, column: 13, scope: !264)
!354 = !DILocation(line: 123, column: 26, scope: !264)
!355 = !DILocation(line: 123, column: 25, scope: !264)
!356 = !DILocation(line: 123, column: 10, scope: !264)
!357 = !DILocation(line: 126, column: 17, scope: !45)
!358 = !DILocation(line: 126, column: 3, scope: !45)
!359 = !DILocation(line: 126, column: 11, scope: !45)
!360 = !DILocation(line: 126, column: 15, scope: !45)
!361 = !DILocation(line: 127, column: 3, scope: !45)
!362 = !DILocation(line: 127, column: 11, scope: !45)
!363 = !DILocation(line: 127, column: 15, scope: !45)
!364 = !DILocation(line: 128, column: 17, scope: !45)
!365 = !DILocation(line: 128, column: 12, scope: !45)
!366 = !DILocation(line: 128, column: 10, scope: !45)
!367 = !DILocation(line: 129, column: 7, scope: !368)
!368 = distinct !DILexicalBlock(scope: !45, file: !1, line: 129, column: 7)
!369 = !DILocation(line: 129, column: 14, scope: !368)
!370 = !DILocation(line: 129, column: 7, scope: !45)
!371 = !DILocation(line: 130, column: 22, scope: !368)
!372 = !DILocation(line: 130, column: 7, scope: !368)
!373 = !DILocation(line: 130, column: 15, scope: !368)
!374 = !DILocation(line: 130, column: 19, scope: !368)
!375 = !DILocation(line: 132, column: 3, scope: !45)
!376 = !DILocation(line: 133, column: 1, scope: !45)
!377 = distinct !DISubprogram(name: "gsl_sf_mathieu_Ms_e", scope: !1, file: !1, line: 136, type: !46, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !57)
!378 = !DILocalVariable(name: "kind", arg: 1, scope: !377, file: !1, line: 136, type: !48)
!379 = !DILocation(line: 136, column: 29, scope: !377)
!380 = !DILocalVariable(name: "order", arg: 2, scope: !377, file: !1, line: 136, type: !48)
!381 = !DILocation(line: 136, column: 39, scope: !377)
!382 = !DILocalVariable(name: "qq", arg: 3, scope: !377, file: !1, line: 136, type: !49)
!383 = !DILocation(line: 136, column: 53, scope: !377)
!384 = !DILocalVariable(name: "zz", arg: 4, scope: !377, file: !1, line: 136, type: !49)
!385 = !DILocation(line: 136, column: 64, scope: !377)
!386 = !DILocalVariable(name: "result", arg: 5, scope: !377, file: !1, line: 137, type: !50)
!387 = !DILocation(line: 137, column: 38, scope: !377)
!388 = !DILocalVariable(name: "even_odd", scope: !377, file: !1, line: 139, type: !48)
!389 = !DILocation(line: 139, column: 7, scope: !377)
!390 = !DILocalVariable(name: "kk", scope: !377, file: !1, line: 139, type: !48)
!391 = !DILocation(line: 139, column: 17, scope: !377)
!392 = !DILocalVariable(name: "mm", scope: !377, file: !1, line: 139, type: !48)
!393 = !DILocation(line: 139, column: 21, scope: !377)
!394 = !DILocalVariable(name: "status", scope: !377, file: !1, line: 139, type: !48)
!395 = !DILocation(line: 139, column: 25, scope: !377)
!396 = !DILocalVariable(name: "maxerr", scope: !377, file: !1, line: 140, type: !49)
!397 = !DILocation(line: 140, column: 10, scope: !377)
!398 = !DILocalVariable(name: "amax", scope: !377, file: !1, line: 140, type: !49)
!399 = !DILocation(line: 140, column: 26, scope: !377)
!400 = !DILocalVariable(name: "pi", scope: !377, file: !1, line: 140, type: !49)
!401 = !DILocation(line: 140, column: 32, scope: !377)
!402 = !DILocalVariable(name: "fn", scope: !377, file: !1, line: 140, type: !49)
!403 = !DILocation(line: 140, column: 43, scope: !377)
!404 = !DILocalVariable(name: "factor", scope: !377, file: !1, line: 140, type: !49)
!405 = !DILocation(line: 140, column: 47, scope: !377)
!406 = !DILocalVariable(name: "coeff", scope: !377, file: !1, line: 141, type: !88)
!407 = !DILocation(line: 141, column: 10, scope: !377)
!408 = !DILocalVariable(name: "fc", scope: !377, file: !1, line: 141, type: !49)
!409 = !DILocation(line: 141, column: 39, scope: !377)
!410 = !DILocalVariable(name: "j1c", scope: !377, file: !1, line: 142, type: !49)
!411 = !DILocation(line: 142, column: 10, scope: !377)
!412 = !DILocalVariable(name: "z2c", scope: !377, file: !1, line: 142, type: !49)
!413 = !DILocation(line: 142, column: 15, scope: !377)
!414 = !DILocalVariable(name: "j1mc", scope: !377, file: !1, line: 142, type: !49)
!415 = !DILocation(line: 142, column: 20, scope: !377)
!416 = !DILocalVariable(name: "z2mc", scope: !377, file: !1, line: 142, type: !49)
!417 = !DILocation(line: 142, column: 26, scope: !377)
!418 = !DILocalVariable(name: "j1pc", scope: !377, file: !1, line: 142, type: !49)
!419 = !DILocation(line: 142, column: 32, scope: !377)
!420 = !DILocalVariable(name: "z2pc", scope: !377, file: !1, line: 142, type: !49)
!421 = !DILocation(line: 142, column: 38, scope: !377)
!422 = !DILocalVariable(name: "u1", scope: !377, file: !1, line: 143, type: !49)
!423 = !DILocation(line: 143, column: 10, scope: !377)
!424 = !DILocalVariable(name: "u2", scope: !377, file: !1, line: 143, type: !49)
!425 = !DILocation(line: 143, column: 14, scope: !377)
!426 = !DILocalVariable(name: "aa", scope: !377, file: !1, line: 144, type: !51)
!427 = !DILocation(line: 144, column: 17, scope: !377)
!428 = !DILocation(line: 148, column: 7, scope: !429)
!429 = distinct !DILexicalBlock(scope: !377, file: !1, line: 148, column: 7)
!430 = !DILocation(line: 148, column: 10, scope: !429)
!431 = !DILocation(line: 148, column: 7, scope: !377)
!432 = !DILocation(line: 150, column: 7, scope: !433)
!433 = distinct !DILexicalBlock(scope: !429, file: !1, line: 149, column: 3)
!434 = distinct !{!434, !432}
!435 = !DILocation(line: 150, column: 7, scope: !436)
!436 = !DILexicalBlockFile(scope: !437, file: !1, discriminator: 1)
!437 = distinct !DILexicalBlock(scope: !433, file: !1, line: 150, column: 7)
!438 = !DILocation(line: 151, column: 3, scope: !433)
!439 = !DILocation(line: 152, column: 7, scope: !440)
!440 = distinct !DILexicalBlock(scope: !377, file: !1, line: 152, column: 7)
!441 = !DILocation(line: 152, column: 12, scope: !440)
!442 = !DILocation(line: 152, column: 16, scope: !440)
!443 = !DILocation(line: 152, column: 19, scope: !444)
!444 = !DILexicalBlockFile(scope: !440, file: !1, discriminator: 1)
!445 = !DILocation(line: 152, column: 24, scope: !444)
!446 = !DILocation(line: 152, column: 7, scope: !444)
!447 = !DILocation(line: 154, column: 7, scope: !448)
!448 = distinct !DILexicalBlock(scope: !440, file: !1, line: 153, column: 3)
!449 = distinct !{!449, !447}
!450 = !DILocation(line: 154, column: 7, scope: !451)
!451 = !DILexicalBlockFile(scope: !452, file: !1, discriminator: 1)
!452 = distinct !DILexicalBlock(scope: !448, file: !1, line: 154, column: 7)
!453 = !DILocation(line: 155, column: 3, scope: !448)
!454 = !DILocation(line: 158, column: 7, scope: !455)
!455 = distinct !DILexicalBlock(scope: !377, file: !1, line: 158, column: 7)
!456 = !DILocation(line: 158, column: 13, scope: !455)
!457 = !DILocation(line: 158, column: 7, scope: !377)
!458 = !DILocation(line: 160, column: 7, scope: !459)
!459 = distinct !DILexicalBlock(scope: !455, file: !1, line: 159, column: 3)
!460 = !DILocation(line: 160, column: 15, scope: !459)
!461 = !DILocation(line: 160, column: 19, scope: !459)
!462 = !DILocation(line: 161, column: 7, scope: !459)
!463 = !DILocation(line: 161, column: 15, scope: !459)
!464 = !DILocation(line: 161, column: 19, scope: !459)
!465 = !DILocation(line: 162, column: 7, scope: !459)
!466 = !DILocation(line: 165, column: 6, scope: !377)
!467 = !DILocation(line: 166, column: 8, scope: !377)
!468 = !DILocation(line: 167, column: 6, scope: !377)
!469 = !DILocation(line: 168, column: 13, scope: !377)
!470 = !DILocation(line: 168, column: 8, scope: !377)
!471 = !DILocation(line: 168, column: 26, scope: !377)
!472 = !DILocation(line: 168, column: 25, scope: !377)
!473 = !DILocation(line: 168, column: 17, scope: !474)
!474 = !DILexicalBlockFile(scope: !377, file: !1, discriminator: 1)
!475 = !DILocation(line: 168, column: 16, scope: !377)
!476 = !DILocation(line: 168, column: 6, scope: !377)
!477 = !DILocation(line: 169, column: 13, scope: !377)
!478 = !DILocation(line: 169, column: 8, scope: !377)
!479 = !DILocation(line: 169, column: 21, scope: !377)
!480 = !DILocation(line: 169, column: 17, scope: !474)
!481 = !DILocation(line: 169, column: 16, scope: !377)
!482 = !DILocation(line: 169, column: 6, scope: !377)
!483 = !DILocation(line: 171, column: 12, scope: !377)
!484 = !DILocation(line: 172, column: 7, scope: !485)
!485 = distinct !DILexicalBlock(scope: !377, file: !1, line: 172, column: 7)
!486 = !DILocation(line: 172, column: 13, scope: !485)
!487 = !DILocation(line: 172, column: 17, scope: !485)
!488 = !DILocation(line: 172, column: 7, scope: !377)
!489 = !DILocation(line: 173, column: 16, scope: !485)
!490 = !DILocation(line: 173, column: 7, scope: !485)
!491 = !DILocation(line: 176, column: 31, scope: !377)
!492 = !DILocation(line: 176, column: 38, scope: !377)
!493 = !DILocation(line: 176, column: 12, scope: !377)
!494 = !DILocation(line: 176, column: 10, scope: !377)
!495 = !DILocation(line: 177, column: 7, scope: !496)
!496 = distinct !DILexicalBlock(scope: !377, file: !1, line: 177, column: 7)
!497 = !DILocation(line: 177, column: 14, scope: !496)
!498 = !DILocation(line: 177, column: 7, scope: !377)
!499 = !DILocation(line: 179, column: 14, scope: !500)
!500 = distinct !DILexicalBlock(scope: !496, file: !1, line: 178, column: 3)
!501 = !DILocation(line: 179, column: 7, scope: !500)
!502 = !DILocation(line: 183, column: 35, scope: !377)
!503 = !DILocation(line: 183, column: 42, scope: !377)
!504 = !DILocation(line: 183, column: 49, scope: !377)
!505 = !DILocation(line: 183, column: 54, scope: !377)
!506 = !DILocation(line: 183, column: 12, scope: !377)
!507 = !DILocation(line: 183, column: 10, scope: !377)
!508 = !DILocation(line: 184, column: 7, scope: !509)
!509 = distinct !DILexicalBlock(scope: !377, file: !1, line: 184, column: 7)
!510 = !DILocation(line: 184, column: 14, scope: !509)
!511 = !DILocation(line: 184, column: 7, scope: !377)
!512 = !DILocation(line: 186, column: 14, scope: !513)
!513 = distinct !DILexicalBlock(scope: !509, file: !1, line: 185, column: 3)
!514 = !DILocation(line: 186, column: 7, scope: !513)
!515 = !DILocation(line: 189, column: 7, scope: !516)
!516 = distinct !DILexicalBlock(scope: !377, file: !1, line: 189, column: 7)
!517 = !DILocation(line: 189, column: 16, scope: !516)
!518 = !DILocation(line: 189, column: 7, scope: !377)
!519 = !DILocation(line: 191, column: 14, scope: !520)
!520 = distinct !DILexicalBlock(scope: !521, file: !1, line: 191, column: 7)
!521 = distinct !DILexicalBlock(scope: !516, file: !1, line: 190, column: 3)
!522 = !DILocation(line: 191, column: 12, scope: !520)
!523 = !DILocation(line: 191, column: 18, scope: !524)
!524 = !DILexicalBlockFile(scope: !525, file: !1, discriminator: 1)
!525 = distinct !DILexicalBlock(scope: !520, file: !1, line: 191, column: 7)
!526 = !DILocation(line: 191, column: 20, scope: !524)
!527 = !DILocation(line: 191, column: 7, scope: !524)
!528 = !DILocation(line: 193, column: 18, scope: !529)
!529 = distinct !DILexicalBlock(scope: !525, file: !1, line: 192, column: 7)
!530 = !DILocation(line: 193, column: 18, scope: !531)
!531 = !DILexicalBlockFile(scope: !529, file: !1, discriminator: 1)
!532 = !DILocation(line: 193, column: 18, scope: !533)
!533 = !DILexicalBlockFile(scope: !529, file: !1, discriminator: 2)
!534 = !DILocation(line: 193, column: 18, scope: !535)
!535 = !DILexicalBlockFile(scope: !529, file: !1, discriminator: 3)
!536 = !DILocation(line: 193, column: 16, scope: !535)
!537 = !DILocation(line: 194, column: 26, scope: !538)
!538 = distinct !DILexicalBlock(scope: !529, file: !1, line: 194, column: 15)
!539 = !DILocation(line: 194, column: 20, scope: !538)
!540 = !DILocation(line: 194, column: 15, scope: !538)
!541 = !DILocation(line: 194, column: 31, scope: !538)
!542 = !DILocation(line: 194, column: 30, scope: !538)
!543 = !DILocation(line: 194, column: 38, scope: !538)
!544 = !DILocation(line: 194, column: 36, scope: !538)
!545 = !DILocation(line: 194, column: 15, scope: !529)
!546 = !DILocation(line: 195, column: 15, scope: !538)
!547 = !DILocation(line: 197, column: 35, scope: !529)
!548 = !DILocation(line: 197, column: 39, scope: !529)
!549 = !DILocation(line: 197, column: 18, scope: !529)
!550 = !DILocation(line: 197, column: 16, scope: !529)
!551 = !DILocation(line: 198, column: 35, scope: !529)
!552 = !DILocation(line: 198, column: 37, scope: !529)
!553 = !DILocation(line: 198, column: 41, scope: !529)
!554 = !DILocation(line: 198, column: 18, scope: !529)
!555 = !DILocation(line: 198, column: 16, scope: !529)
!556 = !DILocation(line: 199, column: 15, scope: !557)
!557 = distinct !DILexicalBlock(scope: !529, file: !1, line: 199, column: 15)
!558 = !DILocation(line: 199, column: 20, scope: !557)
!559 = !DILocation(line: 199, column: 15, scope: !529)
!560 = !DILocation(line: 201, column: 39, scope: !561)
!561 = distinct !DILexicalBlock(scope: !557, file: !1, line: 200, column: 11)
!562 = !DILocation(line: 201, column: 43, scope: !561)
!563 = !DILocation(line: 201, column: 22, scope: !561)
!564 = !DILocation(line: 201, column: 20, scope: !561)
!565 = !DILocation(line: 202, column: 39, scope: !561)
!566 = !DILocation(line: 202, column: 41, scope: !561)
!567 = !DILocation(line: 202, column: 45, scope: !561)
!568 = !DILocation(line: 202, column: 22, scope: !561)
!569 = !DILocation(line: 202, column: 20, scope: !561)
!570 = !DILocation(line: 203, column: 11, scope: !561)
!571 = !DILocation(line: 206, column: 39, scope: !572)
!572 = distinct !DILexicalBlock(scope: !557, file: !1, line: 205, column: 11)
!573 = !DILocation(line: 206, column: 43, scope: !572)
!574 = !DILocation(line: 206, column: 22, scope: !572)
!575 = !DILocation(line: 206, column: 20, scope: !572)
!576 = !DILocation(line: 207, column: 39, scope: !572)
!577 = !DILocation(line: 207, column: 41, scope: !572)
!578 = !DILocation(line: 207, column: 45, scope: !572)
!579 = !DILocation(line: 207, column: 22, scope: !572)
!580 = !DILocation(line: 207, column: 20, scope: !572)
!581 = !DILocation(line: 210, column: 30, scope: !529)
!582 = !DILocation(line: 210, column: 29, scope: !529)
!583 = !DILocation(line: 210, column: 36, scope: !529)
!584 = !DILocation(line: 210, column: 35, scope: !529)
!585 = !DILocation(line: 210, column: 38, scope: !529)
!586 = !DILocation(line: 210, column: 16, scope: !529)
!587 = !DILocation(line: 210, column: 48, scope: !529)
!588 = !DILocation(line: 210, column: 42, scope: !529)
!589 = !DILocation(line: 210, column: 41, scope: !529)
!590 = !DILocation(line: 210, column: 14, scope: !529)
!591 = !DILocation(line: 211, column: 17, scope: !529)
!592 = !DILocation(line: 211, column: 21, scope: !529)
!593 = !DILocation(line: 211, column: 26, scope: !529)
!594 = !DILocation(line: 211, column: 25, scope: !529)
!595 = !DILocation(line: 211, column: 33, scope: !529)
!596 = !DILocation(line: 211, column: 38, scope: !529)
!597 = !DILocation(line: 211, column: 37, scope: !529)
!598 = !DILocation(line: 211, column: 31, scope: !529)
!599 = !DILocation(line: 211, column: 19, scope: !529)
!600 = !DILocation(line: 211, column: 14, scope: !529)
!601 = !DILocation(line: 212, column: 7, scope: !529)
!602 = !DILocation(line: 191, column: 45, scope: !603)
!603 = !DILexicalBlockFile(scope: !525, file: !1, discriminator: 2)
!604 = !DILocation(line: 191, column: 7, scope: !603)
!605 = distinct !{!605, !606}
!606 = !DILocation(line: 191, column: 7, scope: !521)
!607 = !DILocation(line: 214, column: 18, scope: !521)
!608 = !DILocation(line: 214, column: 20, scope: !521)
!609 = !DILocation(line: 214, column: 13, scope: !521)
!610 = !DILocation(line: 214, column: 26, scope: !521)
!611 = !DILocation(line: 214, column: 25, scope: !521)
!612 = !DILocation(line: 214, column: 10, scope: !521)
!613 = !DILocation(line: 215, column: 3, scope: !521)
!614 = !DILocation(line: 218, column: 14, scope: !615)
!615 = distinct !DILexicalBlock(scope: !616, file: !1, line: 218, column: 7)
!616 = distinct !DILexicalBlock(scope: !516, file: !1, line: 217, column: 3)
!617 = !DILocation(line: 218, column: 12, scope: !615)
!618 = !DILocation(line: 218, column: 18, scope: !619)
!619 = !DILexicalBlockFile(scope: !620, file: !1, discriminator: 1)
!620 = distinct !DILexicalBlock(scope: !615, file: !1, line: 218, column: 7)
!621 = !DILocation(line: 218, column: 20, scope: !619)
!622 = !DILocation(line: 218, column: 7, scope: !619)
!623 = !DILocation(line: 220, column: 18, scope: !624)
!624 = distinct !DILexicalBlock(scope: !620, file: !1, line: 219, column: 7)
!625 = !DILocation(line: 220, column: 18, scope: !626)
!626 = !DILexicalBlockFile(scope: !624, file: !1, discriminator: 1)
!627 = !DILocation(line: 220, column: 18, scope: !628)
!628 = !DILexicalBlockFile(scope: !624, file: !1, discriminator: 2)
!629 = !DILocation(line: 220, column: 18, scope: !630)
!630 = !DILexicalBlockFile(scope: !624, file: !1, discriminator: 3)
!631 = !DILocation(line: 220, column: 16, scope: !630)
!632 = !DILocation(line: 221, column: 26, scope: !633)
!633 = distinct !DILexicalBlock(scope: !624, file: !1, line: 221, column: 15)
!634 = !DILocation(line: 221, column: 20, scope: !633)
!635 = !DILocation(line: 221, column: 15, scope: !633)
!636 = !DILocation(line: 221, column: 31, scope: !633)
!637 = !DILocation(line: 221, column: 30, scope: !633)
!638 = !DILocation(line: 221, column: 38, scope: !633)
!639 = !DILocation(line: 221, column: 36, scope: !633)
!640 = !DILocation(line: 221, column: 15, scope: !624)
!641 = !DILocation(line: 222, column: 15, scope: !633)
!642 = !DILocation(line: 224, column: 34, scope: !624)
!643 = !DILocation(line: 224, column: 38, scope: !624)
!644 = !DILocation(line: 224, column: 17, scope: !624)
!645 = !DILocation(line: 224, column: 15, scope: !624)
!646 = !DILocation(line: 225, column: 35, scope: !624)
!647 = !DILocation(line: 225, column: 37, scope: !624)
!648 = !DILocation(line: 225, column: 41, scope: !624)
!649 = !DILocation(line: 225, column: 18, scope: !624)
!650 = !DILocation(line: 225, column: 16, scope: !624)
!651 = !DILocation(line: 226, column: 15, scope: !652)
!652 = distinct !DILexicalBlock(scope: !624, file: !1, line: 226, column: 15)
!653 = !DILocation(line: 226, column: 20, scope: !652)
!654 = !DILocation(line: 226, column: 15, scope: !624)
!655 = !DILocation(line: 228, column: 38, scope: !656)
!656 = distinct !DILexicalBlock(scope: !652, file: !1, line: 227, column: 11)
!657 = !DILocation(line: 228, column: 42, scope: !656)
!658 = !DILocation(line: 228, column: 21, scope: !656)
!659 = !DILocation(line: 228, column: 19, scope: !656)
!660 = !DILocation(line: 229, column: 39, scope: !656)
!661 = !DILocation(line: 229, column: 41, scope: !656)
!662 = !DILocation(line: 229, column: 45, scope: !656)
!663 = !DILocation(line: 229, column: 22, scope: !656)
!664 = !DILocation(line: 229, column: 20, scope: !656)
!665 = !DILocation(line: 230, column: 11, scope: !656)
!666 = !DILocation(line: 233, column: 38, scope: !667)
!667 = distinct !DILexicalBlock(scope: !652, file: !1, line: 232, column: 11)
!668 = !DILocation(line: 233, column: 42, scope: !667)
!669 = !DILocation(line: 233, column: 21, scope: !667)
!670 = !DILocation(line: 233, column: 19, scope: !667)
!671 = !DILocation(line: 234, column: 39, scope: !667)
!672 = !DILocation(line: 234, column: 41, scope: !667)
!673 = !DILocation(line: 234, column: 45, scope: !667)
!674 = !DILocation(line: 234, column: 22, scope: !667)
!675 = !DILocation(line: 234, column: 20, scope: !667)
!676 = !DILocation(line: 237, column: 31, scope: !624)
!677 = !DILocation(line: 237, column: 36, scope: !624)
!678 = !DILocation(line: 237, column: 30, scope: !624)
!679 = !DILocation(line: 237, column: 29, scope: !624)
!680 = !DILocation(line: 237, column: 40, scope: !624)
!681 = !DILocation(line: 237, column: 39, scope: !624)
!682 = !DILocation(line: 237, column: 16, scope: !624)
!683 = !DILocation(line: 237, column: 50, scope: !624)
!684 = !DILocation(line: 237, column: 44, scope: !624)
!685 = !DILocation(line: 237, column: 43, scope: !624)
!686 = !DILocation(line: 237, column: 14, scope: !624)
!687 = !DILocation(line: 238, column: 17, scope: !624)
!688 = !DILocation(line: 238, column: 21, scope: !624)
!689 = !DILocation(line: 238, column: 25, scope: !624)
!690 = !DILocation(line: 238, column: 24, scope: !624)
!691 = !DILocation(line: 238, column: 32, scope: !624)
!692 = !DILocation(line: 238, column: 37, scope: !624)
!693 = !DILocation(line: 238, column: 36, scope: !624)
!694 = !DILocation(line: 238, column: 30, scope: !624)
!695 = !DILocation(line: 238, column: 19, scope: !624)
!696 = !DILocation(line: 238, column: 14, scope: !624)
!697 = !DILocation(line: 239, column: 7, scope: !624)
!698 = !DILocation(line: 218, column: 45, scope: !699)
!699 = !DILexicalBlockFile(scope: !620, file: !1, discriminator: 2)
!700 = !DILocation(line: 218, column: 7, scope: !699)
!701 = distinct !{!701, !702}
!702 = !DILocation(line: 218, column: 7, scope: !616)
!703 = !DILocation(line: 241, column: 18, scope: !616)
!704 = !DILocation(line: 241, column: 20, scope: !616)
!705 = !DILocation(line: 241, column: 13, scope: !616)
!706 = !DILocation(line: 241, column: 26, scope: !616)
!707 = !DILocation(line: 241, column: 25, scope: !616)
!708 = !DILocation(line: 241, column: 10, scope: !616)
!709 = !DILocation(line: 244, column: 17, scope: !377)
!710 = !DILocation(line: 244, column: 3, scope: !377)
!711 = !DILocation(line: 244, column: 11, scope: !377)
!712 = !DILocation(line: 244, column: 15, scope: !377)
!713 = !DILocation(line: 245, column: 3, scope: !377)
!714 = !DILocation(line: 245, column: 11, scope: !377)
!715 = !DILocation(line: 245, column: 15, scope: !377)
!716 = !DILocation(line: 246, column: 17, scope: !377)
!717 = !DILocation(line: 246, column: 12, scope: !377)
!718 = !DILocation(line: 246, column: 10, scope: !377)
!719 = !DILocation(line: 247, column: 7, scope: !720)
!720 = distinct !DILexicalBlock(scope: !377, file: !1, line: 247, column: 7)
!721 = !DILocation(line: 247, column: 14, scope: !720)
!722 = !DILocation(line: 247, column: 7, scope: !377)
!723 = !DILocation(line: 248, column: 22, scope: !720)
!724 = !DILocation(line: 248, column: 7, scope: !720)
!725 = !DILocation(line: 248, column: 15, scope: !720)
!726 = !DILocation(line: 248, column: 19, scope: !720)
!727 = !DILocation(line: 250, column: 3, scope: !377)
!728 = !DILocation(line: 251, column: 1, scope: !377)
!729 = distinct !DISubprogram(name: "gsl_sf_mathieu_Mc_array", scope: !1, file: !1, line: 254, type: !730, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !57)
!730 = !DISubroutineType(types: !731)
!731 = !{!48, !48, !48, !48, !49, !49, !732, !747}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_sf_mathieu_workspace", file: !734, line: 60, baseType: !735)
!734 = !DIFile(filename: "../gsl/gsl_sf_mathieu.h", directory: "/fpcc/gsl-2.5/specfunc")
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !734, line: 42, size: 1024, align: 64, elements: !736)
!736 = !{!737, !741, !742, !743, !744, !745, !746, !748, !749, !750, !751, !752, !753, !754, !772, !784}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !735, file: !734, line: 44, baseType: !738, size: 64, align: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !739, line: 62, baseType: !740)
!739 = !DIFile(filename: "/usr/lib/llvm-3.9/bin/../lib/clang/3.9.1/include/stddef.h", directory: "/fpcc/gsl-2.5/specfunc")
!740 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "even_order", scope: !735, file: !734, line: 45, baseType: !738, size: 64, align: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "odd_order", scope: !735, file: !734, line: 46, baseType: !738, size: 64, align: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "extra_values", scope: !735, file: !734, line: 47, baseType: !48, size: 32, align: 32, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "qa", scope: !735, file: !734, line: 48, baseType: !49, size: 64, align: 64, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "qb", scope: !735, file: !734, line: 49, baseType: !49, size: 64, align: 64, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !735, file: !734, line: 50, baseType: !747, size: 64, align: 64, offset: 384)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !735, file: !734, line: 51, baseType: !747, size: 64, align: 64, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "dd", scope: !735, file: !734, line: 52, baseType: !747, size: 64, align: 64, offset: 512)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ee", scope: !735, file: !734, line: 53, baseType: !747, size: 64, align: 64, offset: 576)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !735, file: !734, line: 54, baseType: !747, size: 64, align: 64, offset: 640)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "e2", scope: !735, file: !734, line: 55, baseType: !747, size: 64, align: 64, offset: 704)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "zz", scope: !735, file: !734, line: 56, baseType: !747, size: 64, align: 64, offset: 768)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !735, file: !734, line: 57, baseType: !755, size: 64, align: 64, offset: 832)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !757, line: 50, baseType: !758)
!757 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/fpcc/gsl-2.5/specfunc")
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !757, line: 42, size: 320, align: 64, elements: !759)
!759 = !{!760, !761, !762, !763, !771}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !758, file: !757, line: 44, baseType: !738, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !758, file: !757, line: 45, baseType: !738, size: 64, align: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !758, file: !757, line: 46, baseType: !747, size: 64, align: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !758, file: !757, line: 47, baseType: !764, size: 64, align: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64, align: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !766, line: 44, baseType: !767)
!766 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/fpcc/gsl-2.5/specfunc")
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !766, line: 38, size: 128, align: 64, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !767, file: !766, line: 40, baseType: !738, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !767, file: !766, line: 41, baseType: !747, size: 64, align: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !758, file: !757, line: 48, baseType: !48, size: 32, align: 32, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "evec", scope: !735, file: !734, line: 58, baseType: !773, size: 64, align: 64, offset: 896)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64, align: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !775, line: 50, baseType: !776)
!775 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/fpcc/gsl-2.5/specfunc")
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !775, line: 42, size: 384, align: 64, elements: !777)
!777 = !{!778, !779, !780, !781, !782, !783}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !776, file: !775, line: 44, baseType: !738, size: 64, align: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !776, file: !775, line: 45, baseType: !738, size: 64, align: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !776, file: !775, line: 46, baseType: !738, size: 64, align: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !776, file: !775, line: 47, baseType: !747, size: 64, align: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !776, file: !775, line: 48, baseType: !764, size: 64, align: 64, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !776, file: !775, line: 49, baseType: !48, size: 32, align: 32, offset: 320)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "wmat", scope: !735, file: !734, line: 59, baseType: !785, size: 64, align: 64, offset: 960)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_eigen_symmv_workspace", file: !787, line: 54, baseType: !788)
!787 = !DIFile(filename: "../gsl/gsl_eigen.h", directory: "/fpcc/gsl-2.5/specfunc")
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !787, line: 48, size: 320, align: 64, elements: !789)
!789 = !{!790, !791, !792, !793, !794}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !788, file: !787, line: 49, baseType: !738, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !788, file: !787, line: 50, baseType: !747, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !788, file: !787, line: 51, baseType: !747, size: 64, align: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !788, file: !787, line: 52, baseType: !747, size: 64, align: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "gs", scope: !788, file: !787, line: 53, baseType: !747, size: 64, align: 64, offset: 256)
!795 = !DILocalVariable(name: "kind", arg: 1, scope: !729, file: !1, line: 254, type: !48)
!796 = !DILocation(line: 254, column: 33, scope: !729)
!797 = !DILocalVariable(name: "nmin", arg: 2, scope: !729, file: !1, line: 254, type: !48)
!798 = !DILocation(line: 254, column: 43, scope: !729)
!799 = !DILocalVariable(name: "nmax", arg: 3, scope: !729, file: !1, line: 254, type: !48)
!800 = !DILocation(line: 254, column: 53, scope: !729)
!801 = !DILocalVariable(name: "qq", arg: 4, scope: !729, file: !1, line: 254, type: !49)
!802 = !DILocation(line: 254, column: 66, scope: !729)
!803 = !DILocalVariable(name: "zz", arg: 5, scope: !729, file: !1, line: 255, type: !49)
!804 = !DILocation(line: 255, column: 36, scope: !729)
!805 = !DILocalVariable(name: "work", arg: 6, scope: !729, file: !1, line: 255, type: !732)
!806 = !DILocation(line: 255, column: 66, scope: !729)
!807 = !DILocalVariable(name: "result_array", arg: 7, scope: !729, file: !1, line: 256, type: !747)
!808 = !DILocation(line: 256, column: 36, scope: !729)
!809 = !DILocalVariable(name: "even_odd", scope: !729, file: !1, line: 258, type: !48)
!810 = !DILocation(line: 258, column: 7, scope: !729)
!811 = !DILocalVariable(name: "order", scope: !729, file: !1, line: 258, type: !48)
!812 = !DILocation(line: 258, column: 17, scope: !729)
!813 = !DILocalVariable(name: "ii", scope: !729, file: !1, line: 258, type: !48)
!814 = !DILocation(line: 258, column: 24, scope: !729)
!815 = !DILocalVariable(name: "kk", scope: !729, file: !1, line: 258, type: !48)
!816 = !DILocation(line: 258, column: 28, scope: !729)
!817 = !DILocalVariable(name: "mm", scope: !729, file: !1, line: 258, type: !48)
!818 = !DILocation(line: 258, column: 32, scope: !729)
!819 = !DILocalVariable(name: "status", scope: !729, file: !1, line: 258, type: !48)
!820 = !DILocation(line: 258, column: 36, scope: !729)
!821 = !DILocalVariable(name: "maxerr", scope: !729, file: !1, line: 259, type: !49)
!822 = !DILocation(line: 259, column: 10, scope: !729)
!823 = !DILocalVariable(name: "amax", scope: !729, file: !1, line: 259, type: !49)
!824 = !DILocation(line: 259, column: 26, scope: !729)
!825 = !DILocalVariable(name: "pi", scope: !729, file: !1, line: 259, type: !49)
!826 = !DILocation(line: 259, column: 32, scope: !729)
!827 = !DILocalVariable(name: "fn", scope: !729, file: !1, line: 259, type: !49)
!828 = !DILocation(line: 259, column: 43, scope: !729)
!829 = !DILocalVariable(name: "coeff", scope: !729, file: !1, line: 260, type: !88)
!830 = !DILocation(line: 260, column: 10, scope: !729)
!831 = !DILocalVariable(name: "fc", scope: !729, file: !1, line: 260, type: !49)
!832 = !DILocation(line: 260, column: 39, scope: !729)
!833 = !DILocalVariable(name: "j1c", scope: !729, file: !1, line: 261, type: !49)
!834 = !DILocation(line: 261, column: 10, scope: !729)
!835 = !DILocalVariable(name: "z2c", scope: !729, file: !1, line: 261, type: !49)
!836 = !DILocation(line: 261, column: 15, scope: !729)
!837 = !DILocalVariable(name: "j1pc", scope: !729, file: !1, line: 261, type: !49)
!838 = !DILocation(line: 261, column: 20, scope: !729)
!839 = !DILocalVariable(name: "z2pc", scope: !729, file: !1, line: 261, type: !49)
!840 = !DILocation(line: 261, column: 26, scope: !729)
!841 = !DILocalVariable(name: "u1", scope: !729, file: !1, line: 262, type: !49)
!842 = !DILocation(line: 262, column: 10, scope: !729)
!843 = !DILocalVariable(name: "u2", scope: !729, file: !1, line: 262, type: !49)
!844 = !DILocation(line: 262, column: 14, scope: !729)
!845 = !DILocalVariable(name: "aa", scope: !729, file: !1, line: 263, type: !747)
!846 = !DILocation(line: 263, column: 11, scope: !729)
!847 = !DILocation(line: 263, column: 16, scope: !729)
!848 = !DILocation(line: 263, column: 22, scope: !729)
!849 = !DILocation(line: 267, column: 10, scope: !850)
!850 = distinct !DILexicalBlock(scope: !729, file: !1, line: 267, column: 3)
