; ModuleID = 'mathieu_workspace.c'
source_filename = "mathieu_workspace.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.gsl_sf_mathieu_workspace = type { i64, i64, i64, i32, double, double, double*, double*, double*, double*, double*, double*, double*, %struct.gsl_vector*, %struct.gsl_matrix*, %struct.gsl_eigen_symmv_workspace* }
%struct.gsl_vector = type { i64, i64, double*, %struct.gsl_block_struct*, i32 }
%struct.gsl_block_struct = type { i64, double* }
%struct.gsl_matrix = type { i64, i64, i64, double*, %struct.gsl_block_struct*, i32 }
%struct.gsl_eigen_symmv_workspace = type { i64, double*, double*, double*, double* }

@.str = private unnamed_addr constant [42 x i8] c"matrix dimension must be positive integer\00", align 1
@.str.1 = private unnamed_addr constant [20 x i8] c"mathieu_workspace.c\00", align 1
@.str.2 = private unnamed_addr constant [39 x i8] c"failed to allocate space for workspace\00", align 1
@.str.3 = private unnamed_addr constant [52 x i8] c"Error allocating memory for characteristic a values\00", align 1
@.str.4 = private unnamed_addr constant [52 x i8] c"Error allocating memory for characteristic b values\00", align 1
@.str.5 = private unnamed_addr constant [38 x i8] c"failed to allocate space for diagonal\00", align 1
@.str.6 = private unnamed_addr constant [34 x i8] c"failed to allocate space for eval\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-19ubuntu1 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !41)
!1 = !DIFile(filename: "mathieu_workspace.c", directory: "/fpcc/gsl-2.5/specfunc")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 39, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/fpcc/gsl-2.5/specfunc")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40}
!6 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!7 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!8 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!9 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!10 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!11 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!12 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!13 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!14 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!15 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!16 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!17 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!18 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!19 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!20 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!21 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!22 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!23 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!24 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!25 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!26 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!27 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!28 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!29 = !DIEnumerator(name: "GSL_ESING", value: 21)
!30 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!31 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!32 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!33 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!34 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!35 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!36 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!37 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!38 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!39 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!40 = !DIEnumerator(name: "GSL_EOF", value: 32)
!41 = !{!42, !43, !107, !59}
!42 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_sf_mathieu_workspace", file: !45, line: 60, baseType: !46)
!45 = !DIFile(filename: "../gsl/gsl_sf_mathieu.h", directory: "/fpcc/gsl-2.5/specfunc")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 42, size: 1024, align: 64, elements: !47)
!47 = !{!48, !52, !53, !54, !55, !57, !58, !60, !61, !62, !63, !64, !65, !66, !84, !96}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !45, line: 44, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !50, line: 62, baseType: !51)
!50 = !DIFile(filename: "/usr/lib/llvm-3.9/bin/../lib/clang/3.9.1/include/stddef.h", directory: "/fpcc/gsl-2.5/specfunc")
!51 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "even_order", scope: !46, file: !45, line: 45, baseType: !49, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "odd_order", scope: !46, file: !45, line: 46, baseType: !49, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "extra_values", scope: !46, file: !45, line: 47, baseType: !42, size: 32, align: 32, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "qa", scope: !46, file: !45, line: 48, baseType: !56, size: 64, align: 64, offset: 256)
!56 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "qb", scope: !46, file: !45, line: 49, baseType: !56, size: 64, align: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !46, file: !45, line: 50, baseType: !59, size: 64, align: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !46, file: !45, line: 51, baseType: !59, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "dd", scope: !46, file: !45, line: 52, baseType: !59, size: 64, align: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ee", scope: !46, file: !45, line: 53, baseType: !59, size: 64, align: 64, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !46, file: !45, line: 54, baseType: !59, size: 64, align: 64, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "e2", scope: !46, file: !45, line: 55, baseType: !59, size: 64, align: 64, offset: 704)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "zz", scope: !46, file: !45, line: 56, baseType: !59, size: 64, align: 64, offset: 768)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !46, file: !45, line: 57, baseType: !67, size: 64, align: 64, offset: 832)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !69, line: 50, baseType: !70)
!69 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/fpcc/gsl-2.5/specfunc")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 42, size: 320, align: 64, elements: !71)
!71 = !{!72, !73, !74, !75, !83}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !70, file: !69, line: 44, baseType: !49, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !70, file: !69, line: 45, baseType: !49, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !70, file: !69, line: 46, baseType: !59, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !70, file: !69, line: 47, baseType: !76, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !78, line: 44, baseType: !79)
!78 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/fpcc/gsl-2.5/specfunc")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !78, line: 38, size: 128, align: 64, elements: !80)
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !79, file: !78, line: 40, baseType: !49, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !79, file: !78, line: 41, baseType: !59, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !70, file: !69, line: 48, baseType: !42, size: 32, align: 32, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "evec", scope: !46, file: !45, line: 58, baseType: !85, size: 64, align: 64, offset: 896)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !87, line: 50, baseType: !88)
!87 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/fpcc/gsl-2.5/specfunc")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !87, line: 42, size: 384, align: 64, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !88, file: !87, line: 44, baseType: !49, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !88, file: !87, line: 45, baseType: !49, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !88, file: !87, line: 46, baseType: !49, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !88, file: !87, line: 47, baseType: !59, size: 64, align: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !88, file: !87, line: 48, baseType: !76, size: 64, align: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !88, file: !87, line: 49, baseType: !42, size: 32, align: 32, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "wmat", scope: !46, file: !45, line: 59, baseType: !97, size: 64, align: 64, offset: 960)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_eigen_symmv_workspace", file: !99, line: 54, baseType: !100)
!99 = !DIFile(filename: "../gsl/gsl_eigen.h", directory: "/fpcc/gsl-2.5/specfunc")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !99, line: 48, size: 320, align: 64, elements: !101)
!101 = !{!102, !103, !104, !105, !106}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !100, file: !99, line: 49, baseType: !49, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !100, file: !99, line: 50, baseType: !59, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !100, file: !99, line: 51, baseType: !59, size: 64, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !100, file: !99, line: 52, baseType: !59, size: 64, align: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "gs", scope: !100, file: !99, line: 53, baseType: !59, size: 64, align: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!108 = !{i32 2, !"Dwarf Version", i32 4}
!109 = !{i32 2, !"Debug Info Version", i32 3}
!110 = !{i32 1, !"PIC Level", i32 2}
!111 = !{!"clang version 3.9.1-19ubuntu1 (tags/RELEASE_391/rc2)"}
!112 = distinct !DISubprogram(name: "gsl_sf_mathieu_alloc", scope: !1, file: !1, line: 29, type: !113, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !117)
!113 = !DISubroutineType(types: !114)
!114 = !{!43, !115, !116}
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!117 = !{}
!118 = !DILocalVariable(name: "nn", arg: 1, scope: !112, file: !1, line: 29, type: !115)
!119 = !DIExpression()
!120 = !DILocation(line: 29, column: 61, scope: !112)
!121 = !DILocalVariable(name: "qq", arg: 2, scope: !112, file: !1, line: 30, type: !116)
!122 = !DILocation(line: 30, column: 61, scope: !112)
!123 = !DILocalVariable(name: "workspace", scope: !112, file: !1, line: 32, type: !43)
!124 = !DILocation(line: 32, column: 29, scope: !112)
!125 = !DILocalVariable(name: "even_order", scope: !112, file: !1, line: 33, type: !126)
!126 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!127 = !DILocation(line: 33, column: 16, scope: !112)
!128 = !DILocation(line: 33, column: 29, scope: !112)
!129 = !DILocation(line: 33, column: 31, scope: !112)
!130 = !DILocation(line: 33, column: 34, scope: !112)
!131 = !DILocalVariable(name: "odd_order", scope: !112, file: !1, line: 33, type: !126)
!132 = !DILocation(line: 33, column: 39, scope: !112)
!133 = !DILocation(line: 33, column: 52, scope: !112)
!134 = !DILocation(line: 33, column: 55, scope: !112)
!135 = !DILocation(line: 33, column: 59, scope: !112)
!136 = !DILocation(line: 33, column: 51, scope: !112)
!137 = !DILocalVariable(name: "extra_values", scope: !112, file: !1, line: 34, type: !126)
!138 = !DILocation(line: 34, column: 16, scope: !112)
!139 = !DILocation(line: 38, column: 37, scope: !112)
!140 = !DILocation(line: 38, column: 32, scope: !112)
!141 = !DILocation(line: 38, column: 28, scope: !142)
!142 = !DILexicalBlockFile(scope: !112, file: !1, discriminator: 1)
!143 = !DILocation(line: 38, column: 27, scope: !112)
!144 = !DILocation(line: 38, column: 18, scope: !112)
!145 = !DILocation(line: 38, column: 49, scope: !112)
!146 = !DILocation(line: 38, column: 16, scope: !112)
!147 = !DILocation(line: 39, column: 16, scope: !112)
!148 = !DILocation(line: 41, column: 7, scope: !149)
!149 = distinct !DILexicalBlock(scope: !112, file: !1, line: 41, column: 7)
!150 = !DILocation(line: 41, column: 10, scope: !149)
!151 = !DILocation(line: 41, column: 14, scope: !149)
!152 = !DILocation(line: 41, column: 7, scope: !112)
!153 = !DILocation(line: 43, column: 7, scope: !154)
!154 = distinct !DILexicalBlock(scope: !149, file: !1, line: 42, column: 3)
!155 = distinct !{!155, !153}
!156 = !DILocation(line: 43, column: 7, scope: !157)
!157 = !DILexicalBlockFile(scope: !158, file: !1, discriminator: 1)
!158 = distinct !DILexicalBlock(scope: !154, file: !1, line: 43, column: 7)
!159 = !DILocation(line: 44, column: 3, scope: !154)
!160 = !DILocation(line: 47, column: 38, scope: !112)
!161 = !DILocation(line: 47, column: 10, scope: !112)
!162 = !DILocation(line: 46, column: 13, scope: !112)
!163 = !DILocation(line: 48, column: 7, scope: !164)
!164 = distinct !DILexicalBlock(scope: !112, file: !1, line: 48, column: 7)
!165 = !DILocation(line: 48, column: 17, scope: !164)
!166 = !DILocation(line: 48, column: 7, scope: !112)
!167 = !DILocation(line: 50, column: 7, scope: !168)
!168 = distinct !DILexicalBlock(scope: !164, file: !1, line: 49, column: 3)
!169 = distinct !{!169, !167}
!170 = !DILocation(line: 50, column: 7, scope: !171)
